In [2]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [4]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [5]:
data.isnull()

       0      1      2
0  False  False  False
1  False   True   True
2   True   True   True
3   True  False  False

In [7]:
# drops any row with NA default
# axis=1 for col drop
# thresh=2 >=2 NAs dropped
# how='all' rows dropped if all NA
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

## Filter missin

In [11]:
# fillna(0) lol 
data.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [12]:
# or give dic to fill colwise
data.fillna({ 1: .5,2:0})

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.5  0.0
2  NaN  0.5  0.0
3  NaN  6.5  3.0

In [13]:
# interpolation method= and limit = 2 only do upto 2 step
data.fillna(method="ffill")

C:\Users\user\AppData\Local\Temp\ipykernel_8976\3839284244.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method="ffill")

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

In [15]:
# mean or med
data.fillna(data.mean())

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0